;; -*- no-byte-compile: t; -*-
;;; lang/python/packages.el

;; Major modes
(package! pip-requirements)

;; LSP
(package! lsp-python-ms)

;; Environment management
(package! pipenv)
(package! pyvenv)
(package! pyenv-mode)

;; Testing frameworks
(package! python-pytest)

;; Import managements
(package! pyimport)
(package! py-isort)
